app/controllers/application_controller.rb

  def set_user
    if current_user&.id
      @user = User.find(current_user.id)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def set_current_user
    if current_user&.id
      @user = User.find(current_user.id)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]