app/controllers/home_controller.rb

SELECT "posts".* FROM "posts" WHERE "posts"."approved" = ?  [["approved", 1]]
---
  def index
    @posts = Post.where(approved:true)