app/controllers/home_controller.rb

  def index
    @posts = Post.where(approved:true, public:true).paginate(:page => params[:page]).order('id DESC')
---
SELECT  "posts".* FROM "posts" WHERE "posts"."approved" = ? AND "posts"."public" = ? ORDER BY id DESC LIMIT ? OFFSET ?  [["approved", 1], ["public", 1], ["LIMIT", 15], ["OFFSET", 0]]
SELECT COUNT(*) FROM "posts" WHERE "posts"."approved" = ? AND "posts"."public" = ?  [["approved", 1], ["public", 1]]