app/controllers/posts_controller.rb

  def index
    @posts = Post.paginate(page: params[:page], per_page: 30)
---
SELECT  "posts".* FROM "posts" LIMIT ? OFFSET ?  [["LIMIT", 30], ["OFFSET", 0]]
SELECT COUNT(*) FROM "posts"